{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "232ccbcd",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
<<<<<<< HEAD
   "execution_count": null,
=======
   "execution_count": 14,
>>>>>>> 4a6da65 (second dag)
   "id": "9e129454",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.driver.BoltDriver object at 0x77a4e4a7b490>\n"
     ]
    }
   ],
   "source": [
    "uri = \"bolt://neo4j:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"adminPass\"\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "ec6b3222-47ac-45e0-b194-cf2c8539586c",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N51', status_description='warn: relationship type does not exist. The relationship type `ROUTE` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=26, offset=26>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 26, 'line': 2, 'column': 26}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n    MATCH (a:Station)-[r:ROUTE]->(b:Station)\\n    RETURN a, r, b\\n    '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Station` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=14, offset=14>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 14, 'line': 2, 'column': 14}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n    MATCH (a:Station)-[r:ROUTE]->(b:Station)\\n    RETURN a, r, b\\n    '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Station` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=37, offset=37>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 37, 'line': 2, 'column': 37}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n    MATCH (a:Station)-[r:ROUTE]->(b:Station)\\n    RETURN a, r, b\\n    '\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Station)-[r:ROUTE]->(b:Station)\n",
    "    RETURN a, r, b\n",
    "    \"\"\"\n",
    "    records = session.run(query).data()  \n",
    "    df_edges = pd.DataFrame(records)\n",
    "    df_edges.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "6a3f2d46-690c-4387-801f-1f0ba6705f2f",
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip -q install pyvis\n",
    "from pyvis.network import Network"
   ]
  },
  {
   "cell_type": "code",
<<<<<<< HEAD
   "execution_count": null,
=======
   "execution_count": 10,
>>>>>>> 4a6da65 (second dag)
   "id": "105fdfc6-0d70-4036-9161-15ea302bcd15",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `station_id` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=34, offset=75>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 75, 'line': 3, 'column': 34}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station)-[r:ROUTE]->(b:Station)\\nRETURN a.station_id AS source, b.station_id AS target\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `station_id` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=10, offset=51>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 51, 'line': 3, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station)-[r:ROUTE]->(b:Station)\\nRETURN a.station_id AS source, b.station_id AS target\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N51', status_description='warn: relationship type does not exist. The relationship type `ROUTE` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=22, offset=22>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 22, 'line': 2, 'column': 22}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station)-[r:ROUTE]->(b:Station)\\nRETURN a.station_id AS source, b.station_id AS target\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Station` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=33, offset=33>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 33, 'line': 2, 'column': 33}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station)-[r:ROUTE]->(b:Station)\\nRETURN a.station_id AS source, b.station_id AS target\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Station` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=10, offset=10>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 10, 'line': 2, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station)-[r:ROUTE]->(b:Station)\\nRETURN a.station_id AS source, b.station_id AS target\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nombre de liens (ROUTE) : 0\n",
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "stations_graph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"800px\"\n",
       "            src=\"stations_graph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x77a4e43e7910>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Station)-[r:ROUTE]->(b:Station)\n",
    "RETURN a.station_id AS source, b.station_id AS target\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    rows = session.run(query).data()\n",
    "\n",
    "print(\"Number of ROUTE edges:\", len(rows))\n",
    "\n",
    "net = Network(height=\"800px\", width=\"100%\", notebook=True, directed=True)\n",
    "\n",
    "for row in rows:\n",
    "    src = str(row[\"source\"])\n",
    "    dst = str(row[\"target\"])\n",
    "    net.add_node(src, label=src)\n",
    "    net.add_node(dst, label=dst)\n",
    "    net.add_edge(src, dst)\n",
    "\n",
    "net.show(\"stations_graph.html\")"
   ]
  },
  {
   "cell_type": "code",
<<<<<<< HEAD
   "execution_count": null,
=======
   "execution_count": 11,
>>>>>>> 4a6da65 (second dag)
   "id": "2c48f164-d542-412a-82d1-5e43069a611a",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `station_id` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=19, offset=19>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 19, 'line': 2, 'column': 19}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station {station_id: 10061}),\\n      (b:Station {station_id: 6017})\\nMATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\\nRETURN [n IN nodes(p) | n.station_id] AS path;\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `station_id` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=19, offset=58>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 58, 'line': 3, 'column': 19}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station {station_id: 10061}),\\n      (b:Station {station_id: 6017})\\nMATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\\nRETURN [n IN nodes(p) | n.station_id] AS path;\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N51', status_description='warn: relationship type does not exist. The relationship type `ROUTE` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=4, column=30, offset=106>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 106, 'line': 4, 'column': 30}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station {station_id: 10061}),\\n      (b:Station {station_id: 6017})\\nMATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\\nRETURN [n IN nodes(p) | n.station_id] AS path;\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Station` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=10, offset=49>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 49, 'line': 3, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station {station_id: 10061}),\\n      (b:Station {station_id: 6017})\\nMATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\\nRETURN [n IN nodes(p) | n.station_id] AS path;\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Station` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=10, offset=10>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 10, 'line': 2, 'column': 10}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station {station_id: 10061}),\\n      (b:Station {station_id: 6017})\\nMATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\\nRETURN [n IN nodes(p) | n.station_id] AS path;\\n'\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `station_id` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=5, column=27, offset=150>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 150, 'line': 5, 'column': 27}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (a:Station {station_id: 10061}),\\n      (b:Station {station_id: 6017})\\nMATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\\nRETURN [n IN nodes(p) | n.station_id] AS path;\\n'\n"
     ]
    },
    {
     "ename": "TypeError",
     "evalue": "'NoneType' object is not subscriptable",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[11], line 15\u001b[0m\n\u001b[1;32m     12\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m driver\u001b[38;5;241m.\u001b[39msession() \u001b[38;5;28;01mas\u001b[39;00m s:\n\u001b[1;32m     13\u001b[0m     rec \u001b[38;5;241m=\u001b[39m s\u001b[38;5;241m.\u001b[39mrun(query, src\u001b[38;5;241m=\u001b[39mSOURCE_ID, dst\u001b[38;5;241m=\u001b[39mTARGET_ID)\u001b[38;5;241m.\u001b[39msingle()\n\u001b[0;32m---> 15\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[43mrec\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mpath\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m]\u001b[49m)\n",
      "\u001b[0;31mTypeError\u001b[0m: 'NoneType' object is not subscriptable"
     ]
    }
   ],
   "source": [
    "SOURCE_ID = \"4004\"\n",
    "TARGET_ID = \"4002\"\n",
    "WEIGHT_PROP = \"risk\"\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (a:Station {station_id: 10061}),\n",
    "      (b:Station {station_id: 6017})\n",
    "MATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\n",
    "RETURN [n IN nodes(p) | n.station_id] AS path;\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as s:\n",
    "    rec = s.run(query, src=SOURCE_ID, dst=TARGET_ID).single()\n",
    "\n",
    "print(rec[\"path\"])"
   ]
  },
  {
   "cell_type": "code",
<<<<<<< HEAD
   "execution_count": null,
=======
   "execution_count": 12,
>>>>>>> 4a6da65 (second dag)
   "id": "ad44aa8c-391e-4281-968d-0c715159ca5d",
   "metadata": {},
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "{neo4j_code: Neo.ClientError.Procedure.ProcedureCallFailed} {message: Failed to invoke procedure `gds.graph.project`: Caused by: java.lang.IllegalArgumentException: Invalid node projection, one or more labels not found: 'Station'} {gql_status: 52N37} {gql_status_description: error: procedure exception - procedure execution error. Execution of the procedure gds.graph.project() failed.}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mGqlError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[0;31mGqlError\u001b[0m: {gql_status: 52U00} {gql_status_description: error: procedure exception - custom procedure execution error cause. Execution of the procedure gds.graph.project() failed due to java.lang.IllegalArgumentException: Invalid node projection, one or more labels not found: 'Station'.} {message: 52U00: Execution of the procedure gds.graph.project() failed due to java.lang.IllegalArgumentException: Invalid node projection, one or more labels not found: 'Station'.} {diagnostic_record: {'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}} {raw_classification: None}",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[0;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[12], line 17\u001b[0m\n\u001b[1;32m      8\u001b[0m session\u001b[38;5;241m.\u001b[39mrun(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\"\"\u001b[39m\n\u001b[1;32m      9\u001b[0m \u001b[38;5;124m    CALL gds.graph.project(\u001b[39m\n\u001b[1;32m     10\u001b[0m \u001b[38;5;124m      \u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mg\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m,\u001b[39m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m     13\u001b[0m \u001b[38;5;124m    )\u001b[39m\n\u001b[1;32m     14\u001b[0m \u001b[38;5;124m\u001b[39m\u001b[38;5;124m\"\"\"\u001b[39m)\n\u001b[1;32m     16\u001b[0m \u001b[38;5;66;03m# 2) Dijkstra (chemin le moins risqué)\u001b[39;00m\n\u001b[0;32m---> 17\u001b[0m rec \u001b[38;5;241m=\u001b[39m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43mf\u001b[39;49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\n\u001b[1;32m     18\u001b[0m \u001b[38;5;124;43m    MATCH (src:Station \u001b[39;49m\u001b[38;5;130;43;01m{{\u001b[39;49;00m\u001b[38;5;124;43mstation_id:$src\u001b[39;49m\u001b[38;5;130;43;01m}}\u001b[39;49;00m\u001b[38;5;124;43m), (dst:Station \u001b[39;49m\u001b[38;5;130;43;01m{{\u001b[39;49;00m\u001b[38;5;124;43mstation_id:$dst\u001b[39;49m\u001b[38;5;130;43;01m}}\u001b[39;49;00m\u001b[38;5;124;43m)\u001b[39;49m\n\u001b[1;32m     19\u001b[0m \u001b[38;5;124;43m    CALL gds.shortestPath.dijkstra.stream(\u001b[39;49m\n\u001b[1;32m     20\u001b[0m \u001b[38;5;124;43m      \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mg\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m,\u001b[39;49m\n\u001b[1;32m     21\u001b[0m \u001b[38;5;124;43m      \u001b[39;49m\u001b[38;5;130;43;01m{{\u001b[39;49;00m\n\u001b[1;32m     22\u001b[0m \u001b[38;5;124;43m        sourceNode: id(src),\u001b[39;49m\n\u001b[1;32m     23\u001b[0m \u001b[38;5;124;43m        targetNode: id(dst),\u001b[39;49m\n\u001b[1;32m     24\u001b[0m \u001b[38;5;124;43m        relationshipWeightProperty: \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;132;43;01m{\u001b[39;49;00m\u001b[43mWEIGHT_PROP\u001b[49m\u001b[38;5;132;43;01m}\u001b[39;49;00m\u001b[38;5;124;43m'\u001b[39;49m\n\u001b[1;32m     25\u001b[0m \u001b[38;5;124;43m      \u001b[39;49m\u001b[38;5;130;43;01m}}\u001b[39;49;00m\n\u001b[1;32m     26\u001b[0m \u001b[38;5;124;43m    )\u001b[39;49m\n\u001b[1;32m     27\u001b[0m \u001b[38;5;124;43m    YIELD totalCost, nodeIds\u001b[39;49m\n\u001b[1;32m     28\u001b[0m \u001b[38;5;124;43m    RETURN totalCost, nodeIds\u001b[39;49m\n\u001b[1;32m     29\u001b[0m \u001b[38;5;124;43m\u001b[39;49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43msrc\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mSOURCE_ID\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdst\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mTARGET_ID\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241m.\u001b[39msingle()\n\u001b[1;32m     31\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m rec \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[1;32m     32\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mAucun chemin trouvé (vérifie les station_id ou la connectivité du graphe).\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/work/session.py:302\u001b[0m, in \u001b[0;36mSession.run\u001b[0;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[1;32m    296\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m TransactionError(\n\u001b[1;32m    297\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_transaction, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mExplicit transaction already open\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m    298\u001b[0m     )\n\u001b[1;32m    300\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result:\n\u001b[1;32m    301\u001b[0m     \u001b[38;5;66;03m# This will buffer upp all records for the previous auto-commit tx\u001b[39;00m\n\u001b[0;32m--> 302\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_auto_result\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer_all\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    304\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection:\n\u001b[1;32m    305\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connect(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mdefault_access_mode)\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/work/result.py:468\u001b[0m, in \u001b[0;36mResult._buffer_all\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    467\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21m_buffer_all\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[0;32m--> 468\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/work/result.py:457\u001b[0m, in \u001b[0;36mResult._buffer\u001b[0;34m(self, n)\u001b[0m\n\u001b[1;32m    455\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m\n\u001b[1;32m    456\u001b[0m record_buffer \u001b[38;5;241m=\u001b[39m deque()\n\u001b[0;32m--> 457\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m record \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m:\n\u001b[1;32m    458\u001b[0m     record_buffer\u001b[38;5;241m.\u001b[39mappend(record)\n\u001b[1;32m    459\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m n \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(record_buffer) \u001b[38;5;241m>\u001b[39m\u001b[38;5;241m=\u001b[39m n:\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/work/result.py:407\u001b[0m, in \u001b[0;36mResult.__iter__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    405\u001b[0m     \u001b[38;5;28;01myield\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_record_buffer\u001b[38;5;241m.\u001b[39mpopleft()\n\u001b[1;32m    406\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_streaming:\n\u001b[0;32m--> 407\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    408\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discarding:\n\u001b[1;32m    409\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discard()\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:192\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    190\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[1;32m    191\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 192\u001b[0m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    193\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[1;32m    194\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/io/_bolt.py:866\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    862\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m    863\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[1;32m    864\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[1;32m    865\u001b[0m )\n\u001b[0;32m--> 866\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    867\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n\u001b[1;32m    868\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/io/_bolt6.py:548\u001b[0m, in \u001b[0;36mBolt6x0._process_message\u001b[0;34m(self, tag, fields)\u001b[0m\n\u001b[1;32m    546\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_enrich_error_diagnostic_record(summary_metadata)\n\u001b[1;32m    547\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 548\u001b[0m     \u001b[43mresponse\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    549\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[1;32m    550\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpool:\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:262\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    260\u001b[0m handler \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mhandlers\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mon_summary\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m    261\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[0;32m--> 262\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_hydrate_error(metadata)\n",
      "\u001b[0;31mClientError\u001b[0m: {neo4j_code: Neo.ClientError.Procedure.ProcedureCallFailed} {message: Failed to invoke procedure `gds.graph.project`: Caused by: java.lang.IllegalArgumentException: Invalid node projection, one or more labels not found: 'Station'} {gql_status: 52N37} {gql_status_description: error: procedure exception - procedure execution error. Execution of the procedure gds.graph.project() failed.}"
     ]
    }
   ],
   "source": [
    "WEIGHT_PROP = \"risk\"\n",
    "SOURCE_ID = 20002\n",
    "TARGET_ID = 4025\n",
    "\n",
    "with driver.session() as session:\n",
    "    session.run(\"CALL gds.graph.drop('g', false) YIELD graphName RETURN graphName\")\n",
    "    session.run(f\"\"\"\n",
    "        CALL gds.graph.project(\n",
    "          'g',\n",
    "          'Station',\n",
    "          {{ ROUTE: {{ properties: ['{WEIGHT_PROP}'] }} }}\n",
    "        )\n",
    "    \"\"\")\n",
    "\n",
    "    rec = session.run(f\"\"\"\n",
    "        MATCH (src:Station {{station_id:$src}}), (dst:Station {{station_id:$dst}})\n",
    "        CALL gds.shortestPath.dijkstra.stream(\n",
    "          'g',\n",
    "          {{\n",
    "            sourceNode: id(src),\n",
    "            targetNode: id(dst),\n",
    "            relationshipWeightProperty: '{WEIGHT_PROP}'\n",
    "          }}\n",
    "        )\n",
    "        YIELD totalCost, nodeIds\n",
    "        RETURN totalCost, nodeIds\n",
    "    \"\"\", src=SOURCE_ID, dst=TARGET_ID).single()\n",
    "\n",
    "    if rec is None:\n",
    "        raise ValueError(\"No path found (check station_ids or graph connectivity).\")\n",
    "\n",
    "    total_cost = rec[\"totalCost\"]\n",
    "    node_ids = rec[\"nodeIds\"]\n",
    "\n",
    "    rec2 = session.run(f\"\"\"\n",
    "        WITH $nodeIds AS ids\n",
    "        UNWIND range(0, size(ids)-2) AS i\n",
    "        MATCH (a) WHERE id(a) = ids[i]\n",
    "        MATCH (b) WHERE id(b) = ids[i+1]\n",
    "        MATCH (a)-[r:ROUTE]->(b)\n",
    "        RETURN a.station_id AS source,\n",
    "               b.station_id AS target,\n",
    "               r.{WEIGHT_PROP} AS w\n",
    "        ORDER BY i\n",
    "    \"\"\", nodeIds=node_ids).data()\n",
    "\n",
    "print(\"Total path weight (\", WEIGHT_PROP, \") =\", total_cost)\n",
    "print(\"Path edges:\")\n",
    "for e in rec2:\n",
    "    print(f\"  {e['source']} -> {e['target']}  ({WEIGHT_PROP}={e['w']:.3f})\")\n",
    "\n",
    "net = Network(height=\"500px\", width=\"100%\", notebook=True, directed=True)\n",
    "\n",
    "for e in rec2:\n",
    "    src, dst, w = str(e[\"source\"]), str(e[\"target\"]), float(e[\"w\"])\n",
    "    net.add_node(src, label=src)\n",
    "    net.add_node(dst, label=dst)\n",
    "    net.add_edge(src, dst, label=f\"{w:.2f}\", title=f\"{WEIGHT_PROP}={w:.3f}\")\n",
    "\n",
    "net.show(\"risk_path.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "a2257179",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>station_id</th>\n",
       "      <th>name</th>\n",
       "      <th>address</th>\n",
       "      <th>district</th>\n",
       "      <th>fluctuation_sum</th>\n",
       "      <th>computed_at</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3015</td>\n",
       "      <td>3015 - SERVIENT / GARIBALDI</td>\n",
       "      <td>Face 112, Rue Servient</td>\n",
       "      <td>Lyon 3e Arrondissement</td>\n",
       "      <td>13.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7051</td>\n",
       "      <td>7051 - GUILLOTIERE / NICOLAÏ</td>\n",
       "      <td>241, Grande Rue de la Guillotière</td>\n",
       "      <td>Lyon 7e Arrondissement</td>\n",
       "      <td>11.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>10018</td>\n",
       "      <td>10018 - TOLSTOÏ / FLORIAN</td>\n",
       "      <td>118, Cours Tolstoï</td>\n",
       "      <td>Villeurbanne</td>\n",
       "      <td>11.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1031</td>\n",
       "      <td>1031 - PLACE DE LA PAIX</td>\n",
       "      <td>Place de la Paix</td>\n",
       "      <td>Lyon 1er Arrondissement</td>\n",
       "      <td>10.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>6017</td>\n",
       "      <td>6017 - LAFAYETTE / INKERMANN</td>\n",
       "      <td>85, Rue d'Inkermann</td>\n",
       "      <td>Lyon 6e Arrondissement</td>\n",
       "      <td>9.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1013</td>\n",
       "      <td>1013 - MARTINIÈRE</td>\n",
       "      <td>46, Quai Saint Vincent</td>\n",
       "      <td>Lyon 1er Arrondissement</td>\n",
       "      <td>9.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2001</td>\n",
       "      <td>2001 - BELLECOUR / RÉPUBLIQUE</td>\n",
       "      <td>4, Place Le Viste</td>\n",
       "      <td>Lyon 2e Arrondissement</td>\n",
       "      <td>9.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>8010</td>\n",
       "      <td>8010 - PLACE MENDÈS FRANCE</td>\n",
       "      <td>95, Avenue de l'Europe</td>\n",
       "      <td>Lyon 8e Arrondissement</td>\n",
       "      <td>9.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>3011</td>\n",
       "      <td>3011 - PART-DIEU / CUIRASSIERS</td>\n",
       "      <td>Rue Docteur Bouchut</td>\n",
       "      <td>Lyon 3e Arrondissement</td>\n",
       "      <td>8.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>6033</td>\n",
       "      <td>6033 - CRÉQUI / LAFAYETTE</td>\n",
       "      <td>153, Rue de Créqui</td>\n",
       "      <td>Lyon 6e Arrondissement</td>\n",
       "      <td>8.0</td>\n",
       "      <td>2025-12-26 20:00:23.297</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   station_id                            name  \\\n",
       "0        3015     3015 - SERVIENT / GARIBALDI   \n",
       "1        7051    7051 - GUILLOTIERE / NICOLAÏ   \n",
       "2       10018       10018 - TOLSTOÏ / FLORIAN   \n",
       "3        1031         1031 - PLACE DE LA PAIX   \n",
       "4        6017    6017 - LAFAYETTE / INKERMANN   \n",
       "5        1013               1013 - MARTINIÈRE   \n",
       "6        2001   2001 - BELLECOUR / RÉPUBLIQUE   \n",
       "7        8010      8010 - PLACE MENDÈS FRANCE   \n",
       "8        3011  3011 - PART-DIEU / CUIRASSIERS   \n",
       "9        6033       6033 - CRÉQUI / LAFAYETTE   \n",
       "\n",
       "                             address                 district  \\\n",
       "0             Face 112, Rue Servient   Lyon 3e Arrondissement   \n",
       "1  241, Grande Rue de la Guillotière   Lyon 7e Arrondissement   \n",
       "2                 118, Cours Tolstoï             Villeurbanne   \n",
       "3                   Place de la Paix  Lyon 1er Arrondissement   \n",
       "4                85, Rue d'Inkermann   Lyon 6e Arrondissement   \n",
       "5             46, Quai Saint Vincent  Lyon 1er Arrondissement   \n",
       "6                  4, Place Le Viste   Lyon 2e Arrondissement   \n",
       "7             95, Avenue de l'Europe   Lyon 8e Arrondissement   \n",
       "8                Rue Docteur Bouchut   Lyon 3e Arrondissement   \n",
       "9                 153, Rue de Créqui   Lyon 6e Arrondissement   \n",
       "\n",
       "   fluctuation_sum             computed_at  \n",
       "0             13.0 2025-12-26 20:00:23.297  \n",
       "1             11.0 2025-12-26 20:00:23.297  \n",
       "2             11.0 2025-12-26 20:00:23.297  \n",
       "3             10.0 2025-12-26 20:00:23.297  \n",
       "4              9.0 2025-12-26 20:00:23.297  \n",
       "5              9.0 2025-12-26 20:00:23.297  \n",
       "6              9.0 2025-12-26 20:00:23.297  \n",
       "7              9.0 2025-12-26 20:00:23.297  \n",
       "8              8.0 2025-12-26 20:00:23.297  \n",
       "9              8.0 2025-12-26 20:00:23.297  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Compute & display Top-10 saved collection\n",
    "# This cell fetches the collection `velov_top10_fluctuations` and shows it as a table\n",
    "try:\n",
    "    from pymongo import MongoClient\n",
    "    client = MongoClient(\"mongodb://mongo:27017/\", username=\"admin\",\n",
    "        password=\"admin\")  # or 'mongodb://mongo:27017/' when running in Docker\n",
    "    db = client[\"VelovRealtimeDB\"]\n",
    "    col = db[\"velov_top10_fluctuations\"]\n",
    "    df_top10_saved = pd.DataFrame(list(col.find({}, {\"_id\":0})))\n",
    "    if df_top10_saved.empty:\n",
    "        print(\"No top10 documents found in velov_top10_fluctuations\")\n",
    "    else:\n",
    "        display(df_top10_saved[[\"station_id\",\"name\",\"address\",\"district\",\"fluctuation_sum\",\"computed_at\"]])\n",
    "except Exception as e:\n",
    "    print(\"Error fetching saved top10:\", e)\n",
    "finally:\n",
    "    try:\n",
    "        client.close()\n",
    "    except Exception:\n",
    "        pass"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "49af739f-aaf1-4c79-b881-c2653ebf2a0d",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
