{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "232ccbcd",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "9e129454",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.driver.BoltDriver object at 0x7788c84dded0>\n"
     ]
    }
   ],
   "source": [
    "uri = \"bolt://neo4j:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"adminPass\"\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth= (username, password))\n",
    "print( driver)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "ec6b3222-47ac-45e0-b194-cf2c8539586c",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Station)-[r:ROUTE]->(b:Station)\n",
    "    RETURN a, r, b\n",
    "    \"\"\"\n",
    "    records = session.run(query).data()  \n",
    "    df_edges = pd.DataFrame(records)\n",
    "    df_edges.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "6a3f2d46-690c-4387-801f-1f0ba6705f2f",
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip -q install pyvis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "105fdfc6-0d70-4036-9161-15ea302bcd15",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nombre de liens (ROUTE) : 1830\n",
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "stations_graph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"800px\"\n",
       "            src=\"stations_graph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7788c82cf910>"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 2) Connexion Neo4j\n",
    "# - si ton notebook est sur ta machine : bolt://localhost:7687\n",
    "# - si ton notebook est dans Docker : bolt://neo4j:7687\n",
    "\n",
    "# 3) Récupérer toutes les routes (donc implicitement toutes les stations connectées)\n",
    "query = \"\"\"\n",
    "MATCH (a:Station)-[r:ROUTE]->(b:Station)\n",
    "RETURN a.station_id AS source, b.station_id AS target\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    rows = session.run(query).data()\n",
    "\n",
    "\n",
    "print(\"Nombre de liens (ROUTE) :\", len(rows))\n",
    "\n",
    "# 4) Visualisation\n",
    "net = Network(height=\"800px\", width=\"100%\", notebook=True, directed=True)\n",
    "\n",
    "for row in rows:\n",
    "    src = str(row[\"source\"])\n",
    "    dst = str(row[\"target\"])\n",
    "    net.add_node(src, label=src)\n",
    "    net.add_node(dst, label=dst)\n",
    "    net.add_edge(src, dst)\n",
    "\n",
    "net.show(\"stations_graph.html\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "2c48f164-d542-412a-82d1-5e43069a611a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[10061, 10045, 6017]\n"
     ]
    }
   ],
   "source": [
    "SOURCE_ID = \"4004\"\n",
    "TARGET_ID = \"4002\"\n",
    "WEIGHT_PROP = \"risk\" \n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (a:Station {station_id: 10061}),\n",
    "      (b:Station {station_id: 6017})\n",
    "MATCH p = shortestPath((a)-[:ROUTE*..50]->(b))\n",
    "RETURN [n IN nodes(p) | n.station_id] AS path;\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as s:\n",
    "    rec = s.run(query, src=SOURCE_ID, dst=TARGET_ID).single()\n",
    "    \n",
    "print(rec[\"path\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8e1a31ea-78bd-4bf7-9608-f689d6d709a5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
